app/views/schedules/_schedule.json.jbuilder


json.update_url schedule_path(schedule, method: :patch)
---
UPDATE "schedules" SET "start" = $1, "end" = $2, "updated_at" = $3 WHERE "schedules"."id" = $4  [["start", 2016-10-06 00:00:00 UTC], ["end", 2016-10-07 00:00:00 UTC], ["updated_at", 2016-10-17 22:54:33 UTC], ["id", 1]]