app/views/estudiantes/_infoTutor.html.erb

SELECT "subjects".* FROM "subjects" INNER JOIN "likes_tutors_by_subjects" ON "subjects"."id" = "likes_tutors_by_subjects"."subject_id" WHERE "likes_tutors_by_subjects"."tutor_id" = $1  [["tutor_id", 1]]
---
    <tbody>
      <% @tutors.subjects.each do |subject| %>