app/controllers/estudiantes_controller.rb

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def infoTutores
    if request.xhr?
      @tutors = Tutor.find(params[:id])

SELECT "tutors".* FROM "tutors"
---
  def renderEstudiantes
    @tutors = Tutor.all