app/controllers/likes_tutors_by_subjects_controller.rb

  def index
    @likes_tutors_by_subjects = LikesTutorsBySubjects.all
---
SELECT "likes_tutors_by_subjects".* FROM "likes_tutors_by_subjects"

    def set_likes_tutors_by_subject
      @likes_tutors_by_subject = LikesTutorsBySubjects.find(params[:id])
---
SELECT  "likes_tutors_by_subjects".* FROM "likes_tutors_by_subjects" WHERE "likes_tutors_by_subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]