app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules" WHERE ("schedules"."start" BETWEEN $1 AND $2)  [["start", nil], ["start", nil]]
---
  def index
      #@schedules = Schedule.where(start: params[:start]..params[:end])
      if tutor_signed_in?
        @schedules =  Schedule.where(likes_tutors_by_subject_id: current_tutor.likes_tutors_by_subjects,start: params[:start]..params[:end])
      elsif student_signed_in?
        @schedules = Schedule.where(start: params[:start]..params[:end])

INSERT INTO "schedules" ("title", "start", "end", "color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "calculo"], ["start", 2016-10-13 00:00:00 UTC], ["end", 2016-10-14 00:00:00 UTC], ["color", "yellow"], ["created_at", 2016-10-17 22:54:11 UTC], ["updated_at", 2016-10-17 22:54:11 UTC]]
---
  def create
    @schedule = Schedule.new(schedule_params)
    @schedule.save

UPDATE "schedules" SET "start" = $1, "end" = $2, "updated_at" = $3 WHERE "schedules"."id" = $4  [["start", 2016-10-06 00:00:00 UTC], ["end", 2016-10-07 00:00:00 UTC], ["updated_at", 2016-10-17 22:54:33 UTC], ["id", 1]]
---
  def update
    @schedule.update(schedule_params)

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_schedule
      @schedule = Schedule.find(params[:id])