app/controllers/subjects_controller.rb

  def solve
      @subjects = Subject.order(:name).where("name like ?", "%#{params[:term]}%")
---
SELECT "subjects".* FROM "subjects" WHERE (name like '%g%') ORDER BY "subjects"."name" ASC